Revit 2026 API

# DuctFittingAndAccessoryPressureDropUIDataItem Methods

---

The DuctFittingAndAccessoryPressureDropUIDataItem type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetDuctFittingAndAccessoryData | Gets the fitting data stored in the UI data item. |
|  | GetEntity | Returns the entity set by UI server. or an invalid entity otherwise. |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | SetEntity | Stores the entity in the UI data item. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

DuctFittingAndAccessoryPressureDropUIDataItem Class

Autodesk.Revit.UI.Mechanical Namespace